oxsmt/tools/mutants/registry/euf-predicate-late-bind-drain.patch
diff --git a/smt/theories/euf/euf_adapter.ml b/smt/theories/euf/euf_adapter.ml
index 95634392bf..1bcedf797c 100644
--- a/smt/theories/euf/euf_adapter.ml
+++ b/smt/theories/euf/euf_adapter.ml
@@ -105,7 +105,7 @@ let register_atom t atom term =
             re-reports the currently-entailed truth to the now-bound atom (codex
             late-binding MEDIUM); harmless (a no-op reset) when [term] is freshly
             registered here. *)
-         Euf.rearm_watch t.engine term
+         ignore (t.engine, term)
        | _ -> ())
     | K_foreign -> ())
 ;;
