oxsmt/tools/mutants/registry/rational-word-wrap-neg-int.patch
diff --git a/smt/theories/lia/rational.ml b/smt/theories/lia/rational.ml
index 932be2056d..fbcf3a9406 100644
--- a/smt/theories/lia/rational.ml
+++ b/smt/theories/lia/rational.ml
@@ -58,7 +58,7 @@ let sub_int a b =
   if (b < 0 && r < a) || (b > 0 && r > a) then raise Overflow else r
 ;;
 
-let neg_int a = if a = min_int then raise Overflow else -a
+let neg_int a = -a
 
 let mul_int a b =
   let r = a * b in
