oxsmt/tools/mutants/registry/sat-minimize-unsound.patch
diff --git a/smt/solver/sat.ml b/smt/solver/sat.ml
index 66fa56d914..1bcfa6e2f6 100644
--- a/smt/solver/sat.ml
+++ b/smt/solver/sat.ml
@@ -737,7 +737,7 @@ let analyze t confl =
           while !ok && !k < Array.length rlits do
             let vk = var_of_lit rlits.(!k) in
             if (not (Dynarray.get t.seen vk)) && Dynarray.get t.level vk > 0
-            then ok := false;
+            then ok := true;
             incr k
           done;
           !ok
