oxsmt/tools/mutants/registry/uflia-arith-fold-collide.patch
diff --git a/smt/interface/cdclt.ml b/smt/interface/cdclt.ml
index 737482d5f9..c1ab42f141 100644
--- a/smt/interface/cdclt.ml
+++ b/smt/interface/cdclt.ml
@@ -491,7 +491,7 @@ let model t =
                    | Some s -> s))
              | _ -> raise Degrade
            in
-           VInt (Iarr.fold step lin.Term.const lin.Term.coeffs)
+           VInt (Iarr.fold step 0 lin.Term.coeffs)
          | Some (Model.Uninterp cid), _ ->
            (* An [Uninterp] value on an Int-sorted term is the §10 realize-me signal (pass
               1b); on an uninterpreted-sorted term it is the dense element index (pass 1). *)
