tools/mutants/registry/ctx-shared-memo-noop.patch
diff --git a/smt/interface/presolve.ml b/smt/interface/presolve.ml
index cb85dd9468..358c8802be 100644
--- a/smt/interface/presolve.ml
+++ b/smt/interface/presolve.ml
@@ -531,7 +531,7 @@ let simplify_contextual ctx assertions =
           | Ite _ -> env.subst)
         else env.subst
       in
-      { atoms; subst; memo = Term.Table.create 64 }
+      { atoms; subst; memo = env.memo }
   in
   let rec simp env (t : Term.t) : Term.t =
     incr steps;
