tools/mutants/registry/euf-propagate-sep-skip-rebuild.patch
diff --git a/smt/theories/euf/euf.ml b/smt/theories/euf/euf.ml
index ab947936c2..f4300584ab 100644
--- a/smt/theories/euf/euf.ml
+++ b/smt/theories/euf/euf.ml
@@ -658,7 +658,7 @@ let propagate t =
          let du = find t d.d_a
          and dv = find t d.d_b in
          let key = if du <= dv then pack du dv else pack dv du in
-         Int_set.replace sep key ())
+         ignore (key : int))
       t.diseqs;
     Dynarray.iteri
       (fun idx w ->
