tools/mutants/registry/euf-propagate-sep-stale-reps.patch
diff --git a/smt/theories/euf/euf.ml b/smt/theories/euf/euf.ml
index ab947936c2..488ee05d83 100644
--- a/smt/theories/euf/euf.ml
+++ b/smt/theories/euf/euf.ml
@@ -655,8 +655,8 @@ let propagate t =
     let pack lo hi = (lo * m) + hi in
     Dynarray.iter
       (fun d ->
-         let du = find t d.d_a
-         and dv = find t d.d_b in
+         let du = d.d_a
+         and dv = d.d_b in
          let key = if du <= dv then pack du dv else pack dv du in
          Int_set.replace sep key ())
       t.diseqs;
