tools/mutants/registry/lia-check-skip-empty-interval.patch
diff --git a/smt/theories/lia/simplex.ml b/smt/theories/lia/simplex.ml
index 9d61a42..66fe1ee 100644
--- a/smt/theories/lia/simplex.ml
+++ b/smt/theories/lia/simplex.ml
@@ -420,25 +420,7 @@ let conflict_of t (bi : 'a var) ~low =
    false-SAT). Reading current bounds is the ground truth: reports the conflict iff both
    bounds are still asserted, vanishes exactly when a [pop] removes one. Scans in id order
    (determinism, I6). Farkas certificate: 1·(l - def) + 1·(def - u) = l - u > 0. *)
-let empty_interval_conflict t =
-  let n = Dynarray.length t.vars in
-  let rec go i =
-    if i >= n
-    then None
-    else (
-      let v = get t i in
-      match v.lower, v.upper with
-      | Some l, Some u when Delta.lt u.bval l.bval ->
-        Some
-          (build_conflict
-             t
-             [ { var = i; mult = Rational.one; use_lower = true }
-             ; { var = i; mult = Rational.one; use_lower = false }
-             ])
-      | _ -> go (i + 1))
-  in
-  go 0
-;;
+let empty_interval_conflict _t = None
 
 let check t =
   guarded t (fun () ->
