tools/mutants/registry/rational-word-poly-compare.patch
diff --git a/smt/theories/lia/rational.ml b/smt/theories/lia/rational.ml
index 311d75fcad..1af465b0ea 100644
--- a/smt/theories/lia/rational.ml
+++ b/smt/theories/lia/rational.ml
@@ -264,7 +264,9 @@ let abs x =
 let compare x y =
   if W.is_immediate x && W.is_immediate y
   then Int.compare (W.to_int_unchecked x) (W.to_int_unchecked y)
-  else big_compare (to_big x) (to_big y)
+  else (
+    ignore big_compare;
+    Stdlib.compare x y)
 ;;
 
 (* Value-based equality. Both immediate is a direct int equality; anything else routes
