tools/mutants/registry/rational-word-poly-compare.patch
diff --git a/smt/theories/lia/rational.ml b/smt/theories/lia/rational.ml
index 0aa610a0ee..e4be44acf3 100644
--- a/smt/theories/lia/rational.ml
+++ b/smt/theories/lia/rational.ml
@@ -325,11 +325,8 @@ let compare x y =
   if W.is_immediate x && W.is_immediate y
   then Int.compare (W.to_int_unchecked x) (W.to_int_unchecked y)
   else (
-    match small_parts x, small_parts y with
-    | Some (an, ad), Some (bn, bd) ->
-      (try Int.compare (mul_int an bd) (mul_int bn ad) with
-       | Overflow -> big_compare (to_big x) (to_big y))
-    | _ -> big_compare (to_big x) (to_big y))
+    ignore big_compare;
+    Stdlib.compare x y)
 ;;
 
 (* Value-based equality. Both immediate is a direct int equality; anything else routes
