tools/mutants/registry/smtlib-drop-reserved-quote.patch
diff --git a/smt/smtlib/printer.ml b/smt/smtlib/printer.ml
index 780b151..d226ac0 100644
--- a/smt/smtlib/printer.ml
+++ b/smt/smtlib/printer.ml
@@ -50,22 +50,7 @@ let is_simple_symbol name =
 
 (* SMT-LIB 2.6 §3.1 reserved words: match the symbol syntax but are keywords; quoting
    turns them into legal, distinct symbols. *)
-let reserved_words =
-  [ "_"
-  ; "!"
-  ; "as"
-  ; "let"
-  ; "exists"
-  ; "forall"
-  ; "match"
-  ; "par"
-  ; "BINARY"
-  ; "DECIMAL"
-  ; "HEXADECIMAL"
-  ; "NUMERAL"
-  ; "STRING"
-  ]
-;;
+let reserved_words = []
 
 (* Predefined Core + Ints (QF_UFLIA) function/operator symbols. A user symbol with one of
    these names is unrepresentable (see header). [div]/[mod] are deliberately absent: they
